Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/fees_and_supports_for_third_level_education/fees.html.txt.tmx
Source language: en
Languages: ga

source: Third-level student fees and charges
ga: Táillí do scoláirí tríú leibhéal

source: Most undergraduate students attending publicly funded third-level courses do not have to pay tuition fees
ga: Ní chaitheann an chuid is mó do mhic léinn fhochéimithe atá ag freastal ar chúrsaí tríú leibhéal atá maoinithe go poiblí táillí teagaisc a íoc

source: Under the terms of the Free Fees Initiative, the Department of Education and Skills pays the fees to the colleges instead
ga: Faoi théarmaí an Tionscnamh Saor ó Tháillí, íocann an Roinn Oideachais agus Scileanna na táillí chuig na coláistí ina n-áit

source: A separate annual charge is payable to colleges for the costs of student services and examinations – see ‘Student contribution’ below
ga: Tá muirir bliantúil ar leith iníoctha chuig coláistí do chostais sheirbhísí mac léinn agus scrúduithe – féach ‘Ranníocaíocht na mac léinn’ thíos

source: To qualify for free fees, you must meet criteria with regard to:
ga: Chun cáiliú do tháillí saor in aisce, ní mór duit critéir a chomhlíonadh maidir leis an méid a leanas:

source: • Nationality and immigration status and
ga: • Stádas náisiúntachta agus inimirce agus

source: You must have been living in an EEA member state or Switzerland for at least 3 of the 5 years before starting your course
ga: Ní mór go bhfuil cónaí ort i mballstát an LEE nó san Eilvéis ar feadh 3 bliana as 5 bliana, ar a laghad, sular thosaigh tú do chúrsa

source: The members of the EEA (the European Economic Area) are the member states of the EU, along with Iceland, Norway and Liechtenstein
ga: Is iad na baill den LEE (an Limistéir Eacnamaíochta Eorpach) ná na ball den AE, chomh maith leis an Íoslainn, an Iorua agus an Lichtinstéin

source: You must also fulfil one of the following 6 criteria as regards nationality and immigration status in Ireland:
ga: Anuas air sin, ní mór duit ceann amháin de na 6 chritéar a leanas a chomhlíonadh maidir le stádas náisiúntachta agus inimirce in Éirinn:

source: Be a citizen of an EEA member state (see above) or Switzerland or
ga: A bheith i do shaoránach de bhallstát LEE (féach thuas) nó an Eilbhéis nó

source: Have official refugee status or
ga: Stádas dídeanaithe oifigiúil a bheith agat nó

source: Be a family member of a refugee and have been granted permission to live in the State or
ga: A bheith i do bhall teaghlaigh do dhídeanach agus cead bronnta ort cónaí sa Stát nó

source: Be a family member of an EU national and have permission to live in the State, with a stamp “4EUFAM” on your residence card or
ga: A bheith i do bhall teaghlaigh do náisiúnach AE agus cead a bheith agat cónaí sa Stát leis an stampa “4EUFAM” ar do chárta cónaithe nó

source: Have been granted humanitarian leave to remain in the State or
ga: Cead fanachta daonnúlach a bheith bronnta ort don Stát nó

source: Have been granted permission to remain in the State by the Minister for Justice and Equality, following a determination by the Minister not to make a deportation order under Section 3 of the Immigration Act 1999
ga: Cead a bheith bronnta ort fanacht sa Stát ón Aire Dlí agus Cirt agus Athchóirithe Dlí, tar éis cinneadh ón Aire gan ordú díbeartha a bheith déanta faoi Roinn 3 den Acht Inimirce 1999

source: You must also fulfil all of the following 3 course requirements:
ga: Ina theannta sin, ní mór duit gach ceann de na 3 riachtanas cúrsa a leanas a chomhlíonadh:

source: You must be undertaking a full-time undergraduate course of at least 2 years' duration (or certain shorter courses in institutes of technology)
ga: Caithfidh tú a bheith ag tabhairt faoi chúrsa fochéime lánaimseartha de ar a laghad 2 bhliain marthanachta (nó cúrsaí ar leith atá níos giorra in institiúidí teicneolaíochta)

source: You must be a first-time full-time undergraduate
ga: Caithfidh tú a bheith i do fhochéimí céaduaire

source: However, students who already hold a Level 6 or a Level 7 qualification and are progressing to a Level 8 qualification on the National Framework of Qualifications without having received an exemption from the normal duration of the course may be deemed eligible for free fees. Also, you may be eligible for Free Fees, if you attend a course but did not complete it and are returning following a break of at least five years to pursue an approved course at the same level
ga: (Mar sin féin, mic léinn a bhfuil cáilíocht Leibhéal 6 nó Leibhéal 7 acu cheana féin agus atá ag dul ar aghaidh go cáilíocht Leibhéal 8 ar an gCreat Náisiúnta Cáilíochtaí gan díolúine ó ghnáthré an chúrsa a bheith faighte acu, is féidir go measfar iad bheith incháilithe do tháillí saor in aisce.) Chomh maith leis sin, b’fhéidir go bhfuil tú i dteideal Saortháillí a fháil, má d’fhreastail tú ar chúrsa ach nár chríochnaigh tú é agus má tá tú ag filleadh i ndiaidh sos a mhair cúig bliana, ar a laghad, chun tabhairt faoi chúrsaí faofa ar an leibhéal céanna

source: In general, you must not be repeating the year because of failing your exams or changing course
ga: Go ginearálta, ní fhéadfaidh tú a bheith ag athdhéanamh na bliana mar gheall ar theip i do chuid scrúduithe nó athrú cúrsa

source: This requirement may be waived if you repeat a year due to certified serious illness
ga: Is féidir an t-eiseamh seo a tharscaoileadh má athdhéanann tú bliain mar gheall ar thromthinneas deimhnithe

source: The undergraduate courses for which the free fees arrangements apply are courses in:
ga: Tá na cúrsaí a dtéann na socruithe táillí saor in aisce do chúrsaí fochéimithe i bhfeidhm orthu:

source: • Publicly funded colleges of education
ga: • I gcoláistí oideachais atá maoinithe go poiblí

source: • National College of Ireland
ga: • I gColáiste Náisiúnta na hÉireann

source: • A number of religious education institutions
ga: • I roinnt institiúidí oideachais reiligiúin

source: Free fees do not apply to courses in private colleges, whether they have Quality and Qualifications Ireland (QQI) approval or not
ga: Ní bhaineann taillí saor in aisce le cúrsaí i gcoláistí príomhaideacha, is cuma faomhadh ó Dearbhú Cáilíochta agus Cáilíochtaí Éireann (DCCE) acu nó nach bhfuil

source: The fact that a course is listed by the Central Applications Office (CAO) is not, in itself, enough to make it a free fees course
ga: Ní dóthain go bhfuil cúrsa atá liostaithe ag an Lár-Oifig Iontrála (LOI) leis féin, chun cúrsa saor ó tháillí a dhéanamh de

source: Detailed information about assistance with tuition fees is available on studentfinance.ie
ga: Tá eolas sonrach ar chúnamh le táillí teagaisc ar fáil ag airgeadasmacleinn.ie

source: If you do not qualify for free fees you may still be eligible for EU fee rates
ga: Mura gcáilíonn tú do tháillí saor in aisce, d’fhéadfá bheith i dteideal táillí saor in aisce AE a fháil

source: EU fee rates are set by each individual third-level educational institution
ga: Socraíonn gach institiúid oideachais tríú leibhéal aonair rátaí táille AE

source: You should contact the one you are interested in to find out about the EU fee rate and whether you qualify
ga: Ba cheart duit teagmháil a dhéanamh leis an institiúid ar mian leat freastal uirthi chun tuilleadh faisnéise a fháil faoi ráta táille an AE agus cibé acu an gcáilíonn nó nach gcáilíonn tú

source: Some examples of when people might qualify for an EU fee rate are as follows:
ga: Seo a leanas roinnt sampla nuair a d’fhéadfadh daoine cáiliú do ráta táille an AE:

source: • You originally qualified for free fees and are now repeating a year that you failed
ga: • Tá tú cáilithe do tháillí saor in aisce agus tá tú ag tabhairt faoi bhliain arís eile inar theip ort roimhe

source: • You do not fulfil any of the 6 nationality and immigration status criteria listed above but have been tax resident for a number of years in an EEA member state or Switzerland
ga: • Ní chomhlíonann tú aon cheann de na 6 chritéar náisiúntachta agus stádas inimirce a liostaítear thuas ach bhí tú i do chónaitheach cánach ar feadh líon blianta i mballstát den LEE nó san Eilvéis

source: (However, as the third-level institutions are autonomous bodies, this is at the discretion of the institution concerned.)
ga: (Mar gheall gur comhlachtaí féinriartha iad na hinstitiúidí tríú leibhéal, áfach, tá seo faoi lánrogha na hinstitiúide atá i gceist.)

source: From September 2014, an Irish, EU, EEA or Swiss student who has spent at least five years in primary school or second level school in Ireland can avail of EU fee rates
ga: Ón 24 Meán Fómhair 2014 ar aghaidh, féadfaidh mac léinn Éireannach, AE, LEE nó Eilvéiseach a chaith ar a laghad cúig bliana sa bhunscoil nó i scoil dara leibhéal in Éirinn rátaí táille an AE a fháil

source: If you do not qualify for EU fees you can be charged non-EU fees
ga: Mura gcáilíonn tú do tháillí an AE, féadtar táillí neamh-AE a ghearradh ort

source: Each third-level educational institution sets its own fee rates
ga: Socraíonn gach institiúid oideachais tríú leibhéal a rátaí féin táille

source: You should contact the ones you are interested in to find out more about their fees - see 'Where to apply' below
ga: Ba cheart duit teagmháil a dhéanamh leis na hinstitiúidí ar mian leat freastal orthu chun tuilleadh faisnéise a fháil faoina dtáillí - féach ‘Cá ndéanfaidh mé iarratas? ’ thíos

source: In general, you will have to pay fees for a postgraduate course
ga: Go ginearálta, beidh ort táillí a íoc do chúrsa iarchéime

source: However, you may get financial assistance under the Student Grant Scheme
ga: Áfach, d’fhéadfadh go bhfaigheann tú cúnamh airgid faoin Scéim um Dheontais do Mhic Léinn

source: Postgraduates under the Graduate Skills Conversion Programme, courses are free, full-time and intensive
ga: Do chúrsaí iarchéime atá fordheonaithe faoin gClár Tiontú Scileanna Céimithe, tá na cursaí soar in aisce, lánaimseartha agus dian

source: Most colleges charge an annual student contribution, formerly called the student services charge
ga: Gearrann an chuid is mó de choláistí ranníocaíocht mhac léinn bhliantúil, ar tugadh an muirir seirbhísí mac léinn air roimhe seo

source: It is also known as a registration fee and it covers student services and examinations
ga: Tugtar táille chlárúcháin air chomh maith agus clúdaíonn sé seirbhísí mac léinn agus scrúduithe

source: The amount of the contribution varies from one institution to another
ga: Tá an méid ranníocaíochta éagsúil ó institiúid amháin go hinstitiúid eile

source: The maximum rate of the student contribution for the academic year 2017-2018 is €3,000
ga: Is é uasmhéid an ráta do ranníocaíocht mhac léinn don bhliain 2017-2018 ná €3,000

source: More information about the BTEA and the student contribution can be found in our document about social welfare payments and the student grant
ga: Má tá Liúntas chun Filleadh ar an Oideachas (LFO) a fháil agat, d’fhéadfaí go gcáileodh tú do dhíolúine ón ranníocaíocht mhac léinn

source: Student grants provide financial support to eligible students
ga: Soláthraíonn deontais do mhic léinn tacaíocht airgeadais do mhic léinn atá ina teideal

source: There are 2 elements to the student grant - a maintenance grant and a fee grant
ga: Is ranníocaíocht i leith do chostas maireachtála atá sa deontas cothabhála

source: A maintenance grant is a contribution towards your living costs
ga: Is féidir le deontas táille na rudaí seo a leanas a chlúdach:

source: • All or part of your tuition fees
ga: • Do tháillí teagaisc ar fad nó cuid dóibh a chlúdach

source: • All or part of the student contribution
ga: • Cuid de ranníocaíocht an mhic léinn nó í ar fad

source: • Costs of essential field trips
ga: • Na costais a bhaineann le turais páirce riachtanacha

source: If you have qualified for a maintenance grant, you will generally qualify for a fee grant
ga: Más rud é go bhfuil an deontas cothabhála agat, go ginearálta, beidh tú i dteideal deontais táille

source: If you do not qualify for a maintenance grant, but your family’s reckonable income is below certain limits, you may qualify for a partial fee grant
ga: Mura bhfuil tú i dteideal deontais cothabhála, ach má tá ioncam inríofa do theaghlach faoi theorainneacha áirithe, seans go mbeidh tú i dteideal leathdheontais táille

source: This means that you will either be exempt from 50% of the student contribution, or exempt from 50% of any tuition fees and all of the student contribution
ga: Ciallaíonn sé seo nach mbeidh ort 50% den ranníocaíocht mic léinn a íoc, nó nach mbeidh ort 50% de tháillí teagaisc agus an ranníocaíocht mic léinn a íoc

source: The Student Grant Scheme is described in our document on Grants for students in further and higher education
ga: Tá cur síos déanta ar an Scéim Deontais do Mhic Léinn inár gcáipéis ar Dheontais do mhic léinn in oideachas breise agus ardoideachas

source: You may be able to claim tax relief on tuition fees that you have paid
ga: D’fhéadfaí go mbeifeá in ann faoiseamh cánach a éileamh ar na táillí teagaisc atá íoctha agat

source: Families who pay student contributions for more than one student in a year can also claim tax relief on the second and subsequent contributions
ga: Tá sé i gceist go mbeidh teaghlaigh a íocann ranníocaíochtaí mhac léinn do níos mó ná mac léinn amháin i mbliain in ann faoiseamh cánach a éileamh ar an dara agus na ranníocaíochtaí iarshnígh

source: Read more in our document on tax relief for third-level fees
ga: Léigh níos mó in ár gcáipéis ar fhaoiseamh cánach do tháillí tríú leibhéal

source: There is no separate application for the Free Fees Initiative
ga: Níl aon iarratas ar leith don Tionscnamh Saor ó Tháillí

source: Your eligibility will be assessed on the basis of the information you give when applying for a college place
ga: Measfar d’incháilitheacht ar bhunús an eolais a thugann tú nuair atá tú ag cur isteach ar spás i gcoláiste

source: For information about fees contact the third-level educational institution of your choice
ga: D’eolas faoi tháillí téigh i dteagmháil le do rogha institiúid oideachais tríú leibhéal
